aggregate_results.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Std. Dev.
homepage,20,21041,21042,21050,21050,21054,21020,21054,100.00%,.1,.4,7.90
Home page,20,21041,21042,21050,21050,21054,21020,21054,100.00%,.1,.4,7.90
signinForm,2,21026,21013,21040,21040,21040,21013,21040,100.00%,.1,.2,13.50
Login page,2,21026,21013,21040,21040,21040,21013,21040,100.00%,.1,.2,13.50
TOTAL,44,21040,21042,21050,21050,21054,21013,21054,100.00%,.3,.9,9.59