reports/aggregate_results_1.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Std. Dev.
Update Testname and RunId properties,1,506,506,506,506,506,506,506,0.00%,2.0,.0,0.00
/purchase/v1/session,49,659,488,1320,1407,1510,406,1510,0.00%,.4,5.2,352.19
/purchase/v1/basket-Entertainment,48,9436,10404,10485,10526,11221,407,11221,100.00%,.4,.4,2486.81
TOTAL,98,4957,1344,10460,10485,10905,406,11221,48.98%,.7,5.0,4728.20